<?php

//代数演算子
$x = 800;
$y - 200;

//加算
echo '$x + $y = ' . ($x + $y) . "\n";
echo '$x + 10 = ' . ($x + 10) . "\n";
echo '777 + 888 =' . (777 + 888) . "\n";
echo "\n";//改行

//減算
echo '$x - $y = ' . ($x - $y) . "\n";
echo '$x - 10 = ' . ($x - 10) . "\n";
echo '777 - 888 =' . (777 - 888) . "\n";
echo "\n";//改行

//乗算
echo '$x * $y = ' . ($x * $y) . "\n";
echo '$x * 10 = ' . ($x * 10) . "\n";
echo '777 * 888 =' . (777 * 888) . "\n";
echo "\n";//改行

//除算
echo '$x / $y = ' . ($x / $y) . "\n";
echo '$x / 10 = ' . ($x / 10) . "\n";
echo '777 / 888 =' . (777 / 888) . "\n";
echo "\n";//改行

//余剰
echo '$x % $y = ' . ($x % $y) . "\n";
echo '$x % 10 = ' . ($x % 10) . "\n";
echo '777 % 888 =' . (777 % 888) . "\n";
echo "\n";//改行

//代入演算子
$x = 0;

//xの値を表示
echo '$x = 0 ->' . "\t" . '$x = ' . $x . "\n";
//値の代入
echo '$x = 10->' . "\t";
$x = 10;
echo '$x = ' . $x . "\n";
//加算して代入
echo '$x += 10->' . "\t";
$x += 10;
echo '$x = ' . $x . "\n";
//減算して代入
echo '$x -= 10->' . "\t";
$x -= 10;
echo '$x = ' . $x . "\n";
//乗算して代入
echo '$x *= 10->' . "\t";
$x *= 10;
echo '$x = ' . $x . "\n";
//除算して代入
echo '$x /= 10->' . "\t";
$x /= 10;
echo '$x = ' . $x . "\n";
//余剰を代入
echo '$x %= 10->' . "\t";
$x %= 10;
echo '$x = ' . $x . "\n";


?>
