<?php

$x = 100;
$y = 200;

//左辺の値が右辺の値よりも小さい　小なり
echo '$x < $y :' . ($x < $y) . "\n";
echo '$x < 101:' . ($x < 101). "\n";
echo '$x < 100:' . ($x < 100). "\n";
echo "\n";//改行
//左辺の値が右辺のあ帯よりも大きい　大なり
echo '$x > $y :' . ($x > $y) . "\n";
echo '$x > 101:' . ($x > 101). "\n";
echo '$x > 100:' . ($x > 100). "\n";
echo "\n";//改行
//左辺の値が普遍の値以下　小なりイコール
echo '$x <= $y :' . ($x <= $y) . "\n";
echo '$x <= 101:' . ($x <= 101). "\n";
echo '$x <= 100:' . ($x <= 100). "\n";
echo "\n";//改行
//左辺の値が右辺の値以上　大なりイコール
echo '$x >= $y :' . ($x >= $y) . "\n";
echo '$x >= 101:' . ($x >= 101). "\n";
echo '$x >= 100:' . ($x >= 100). "\n";
echo "\n";//改行
//左辺と右辺が等しい
echo '$x == $y :' . ($x == $y) . "\n";
echo '$x == 101:' . ($x == 101). "\n";
echo '$x == 100:' . ($x == 100). "\n";
echo "\n";//改行
//左辺と右辺が等しくない
echo '$x != $y :' . ($x != $y) . "\n";
echo '$x != 101:' . ($x != 101). "\n";
echo '$x != 100:' . ($x != 100). "\n";
echo "\n";//改行

//左辺と右辺が等しくない
echo '$x <> $y :' . ($x <> $y) . "\n";
echo '$x <> 101:' . ($x <> 101). "\n";
echo '$x <> 100:' . ($x <> 100). "\n";
echo "\n";//改行

?>
